chgpalmer/nrf9151-tracker/apps/tracker/src/main.c
	err = nrf_modem_lib_init();
	if (err) {
		LOG_ERR("modem init: %d", err);
		return err;
	}

	/* Device identity: IMEI on hardware, env/Kconfig on native_sim */
	err = hw_id_get(device_id, sizeof(device_id));
	if (err) {
		LOG_ERR("hw_id_get: %d", err);
		return err;
	}
	LOG_INF("device id: %s", device_id);
	LOG_INF("server: coap://%s:%d/obs", SERVER_HOST, SERVER_PORT);
	/* Uplink owns the envelope + flush policy; obs store and the log ring
	 * register as its sources. GPS samples land at the publish interval —
	 * a track segment's time model (anchor + i*dt) is built on it. */
	uplink_init(device_id);
	uplink_on_sent(on_uplink_sent);
	obs_queue_init(POST_INTERVAL_MS);
	event_queue_init();
	log_uplink_init();
	agnss_set_device_id(device_id);
	leds_init();

#if defined(CONFIG_NRF_MODEM_LIB)
	/* Time the SIM (%XSIM notifications) and front-load search retries —
	 * both persist/apply before the attach we're about to start. */
	(void)nrf_modem_at_printf("AT%%XSIM=1");
	fast_search_configure();
#endif

	/* Start LTE async — don't block, status loop shows progress */
	LOG_INF("starting LTE (async)...");
	err = lte_lc_connect_async(lte_handler);
	if (err) {
		LOG_ERR("lte_lc_connect_async: %d", err);
		return err;
	}

#if defined(CONFIG_LTE_LC_PDN_MODULE)
	/* Default-context PDN events tell us when the IP is actually up,
	 * not just when we've registered. */
	err = lte_lc_pdn_default_ctx_events_enable();
	if (err) {
		LOG_WRN("pdn events enable: %d", err);
	}
#endif

	/* Configure GNSS but do NOT start it yet. An unregistered modem runs a
	 * continuous cell search; GNSS running against that starves the search and
	 * gains nothing itself. loc_fsm starts it once LTE has registered. */
	err = gnss_configure();
	if (err) {
		LOG_ERR("gnss configure: %d", err);
		return err;
	}
	/* The GNSS mode actually applied to the modem. Reconfiguring requires a
	 * stop/set/start cycle; a failed start leaves this at OFF so the next
	 * loop pass retries rather than latching a wrong mode. */
	enum loc_gnss_mode gnss_mode_applied = LOC_GNSS_OFF;
	uint16_t gnss_interval_applied = 0;
	bool gnss_blocked_prev = false;
	/* lte_lc_connect_async() below turns the stack on; GNSS_EXCLUSIVE is the
	 * only thing that turns it off. */
	bool lte_stack_on = true;
	/* Snapshot of the most recent PVT frame with FIX_VALID set. The live `pvt`
	 * global only carries defined lat/lon while the flag is set, but the FSM
	 * lets us publish for up to GPS_STALE_S after the fix lapses -- those
	 * publishes must come from this copy, not from whatever an unfixed frame
	 * happens to contain. (static: ~700 B, keep off the main stack) */
	static struct nrf_modem_gnss_pvt_data_frame fix_pvt;
	int64_t fix_pvt_ms = 0; /* when fix_pvt was captured, for the age field */

	/* Wake-PVT forensics (phantom investigation, 2026-07-12): the
	 * receiver marks the first PVT after a duty-cycle sleep
	 * (SLEEP_BETWEEN_PVT) and frames from its self-scheduled ephemeris
	 * downloads (SCHED_DOWNLOAD) — exactly the epochs implicated in the
	 * 501 m time-true/position-stale point. Hold the newest one and log
	 * it when the FSM leaves a parked state, so departure points arrive
	 * pre-labeled: one INF line per departure, never per wake (a parked
	 * night has ~720 wakes; the wire budget says no). */
	static struct {
		int64_t ms;
		bool slept;
		bool sched;
		bool fix;
		float acc;
	} last_wake;
	uint32_t wake_pvts = 0, wake_fixes = 0, sched_pvts = 0;

	int64_t last_post_ms   = 0;
	int64_t queued_fix_ms  = 0;
	int64_t last_acq_log_ms = 0;
	int64_t last_status_ms = 0;
	int64_t next_net_ms    = 0;
	enum loc_state prev_state = LOC_LTE_ATTACH;
	struct loc_status loc = { .state = LOC_LTE_ATTACH };

	loc_fsm_init(k_uptime_get());
	motion_init(k_uptime_get());
	/* Boot picks the parked mode: IMU present = GNSS off while parked,
	 * accelerometer owns departure; absent = legacy periodic checks.
	 * Trusted absolutely after this probe — no runtime health checks. */
	loc_fsm_set_imu_wake(imu_init());
	LOG_INF("IMU: %s", imu_present() ?
		"present — quiescent wake source is the accelerometer" :
		"absent — quiescent wake source is GPS checks");

	for (;;) {
		/* Wait for next PVT event (1 Hz) with a 2s timeout so the
		 * status block still prints even if GNSS is blocked by LTE. */
		k_sem_take(&pvt_sem, K_SECONDS(2));

		int64_t now = k_uptime_get();

		/* With GNSS stopped (PARKED in IMU mode, LTE_ATTACH) the pvt
		 * buffer is a FROZEN copy of the last frame — often FIX_VALID
		 * from the parking fix. Re-processing it every 2 s tick would
		 * ghost-refresh staleness, motion evidence and wake forensics
		 * forever; treat it as no observation at all. */
		bool gnss_live = (gnss_mode_applied != LOC_GNSS_OFF);

		if (gnss_live &&
		    (pvt.flags & (NRF_MODEM_GNSS_PVT_FLAG_SLEEP_BETWEEN_PVT |
				  NRF_MODEM_GNSS_PVT_FLAG_SCHED_DOWNLOAD))) {
			last_wake.ms    = now;
			last_wake.slept = pvt.flags &
				NRF_MODEM_GNSS_PVT_FLAG_SLEEP_BETWEEN_PVT;
			last_wake.sched = pvt.flags &
				NRF_MODEM_GNSS_PVT_FLAG_SCHED_DOWNLOAD;
			last_wake.fix   = pvt.flags &
				NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID;
			last_wake.acc   = pvt.accuracy;
			wake_pvts++;
			wake_fixes += last_wake.fix;
			sched_pvts += last_wake.sched;
		}

		static const struct nrf_modem_gnss_pvt_data_frame quiet = {
			.flags = NRF_MODEM_GNSS_PVT_FLAG_DEADLINE_MISSED,
		};

		if (gnss_live &&
		    (pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID)) {
			/* Known cosmetic quirk, deliberately NOT special-cased:
			 * the first fix after a periodic-mode sleep can carry a
			 * near-pre-sleep position (solver seeded with held state;
			 * field-observed once, 501 m off, corrected next epoch;
			 * DevZone-corroborated class). Pipeline audit 2026-07-12
			 * proved timestamps are capture-time end-to-end, so such
			 * a point is time-true/position-stale. One odd map point
			 * per rare wake beats permanently shipped validation
			 * logic that may never fire again — detect in the DB via
			 * impossible implied speed if it ever matters. */
			fix_pvt = pvt;
			fix_pvt_ms = now;
			motion_note_gps(pvt.latitude, pvt.longitude,
					(double)pvt.accuracy, now);
		}

		/* IMU any-motion interrupt. While quiescent it is the WAKE:
		 * raise an alert event (jumps the uplink queue, so the server
		 * learns "your asset moved" within seconds) and break the
		 * stationary verdict so the FSM leaves for REPORT_CELL.
		 * While already moving it is noise the verdict reflects. */
		if (imu_take_motion()) {
			if (loc.state == LOC_QUIESCENT) {
				event_queue_add(EVENT_REASON_IMU_WAKE, now);
			}
			motion_note_imu(now);
		}

		/* Policy first: it owns the fix-staleness and ephemeris bookkeeping.
		 * The supply verdict gates the C2 escalation (see loc_fsm.h). */
		loc_fsm_set_agnss_supply(agnss_supply_ok());
		loc_fsm_update(gnss_live ? &pvt : &quiet, now, lte_connected,
			       motion_stationary(now), &loc);
		leds_update(&loc, lte_connected);

		/* First parked entry of this boot: checkpoint the modem's NVM
		 * (see the block comment at checkpoint_enabled). CFUN=0 takes
		 * everything down — socket, registration, GNSS — so close the
		 * socket and force the GNSS mode to be reapplied; the FSM sees
		 * the registration drop and walks the normal re-attach path. */
		if (checkpoint_enabled && !checkpoint_done &&
		    loc.state == LOC_QUIESCENT) {
			checkpoint_done = true;
			LOG_INF("LTE: checkpoint — persisting network state "
				"(one re-attach)");
			coap_pub_close();
			(void)lte_lc_func_mode_set(LTE_LC_FUNC_MODE_POWER_OFF);
			(void)lte_lc_func_mode_set(LTE_LC_FUNC_MODE_NORMAL);
			gnss_mode_applied = LOC_GNSS_OFF;
		}

